app/controllers/home_controller.rb

	def user
		@user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

	def users
		@users = User.all
---
SELECT "users".* FROM "users"